#!/usr/bin/env bash

# ref:http://papiro.hatenablog.jp/entry/2016/09/22/215418

echo "01010101 01110011 01100101 00100000 01011000 01100001 01101101 01100001 01110010 01101001 01101110 00101110は文字列をバイナリのビット文字列にしたものこれを文字列に戻す->16進数に変換してxxdコマンドに入力する"

echo "16進数に変換するための準備"
echo 01010101 01110011 01100101 00100000 01011000 01100001 01101101 01100001 01110010 01101001 01101110 00101110 | tr -d ' ' | sed 's/^/obase=16;ibase=2;/'

echo "bcコマンドにより16進数に変換"
echo 01010101 01110011 01100101 00100000 01011000 01100001 01101101 01100001 01110010 01101001 01101110 00101110 | tr -d ' ' | sed 's/^/obase=16;ibase=2;/' | bc ;

echo "xxdコマンドによりバイナリ変換->文字列が出現(Use Xamarin)"
echo 01010101 01110011 01100101 00100000 01011000 01100001 01101101 01100001 01110010 01101001 01101110 00101110 | tr -d ' ' | sed 's/^/obase=16;ibase=2;/' | bc | xxd -p -r

echo "iOS10をバイナリ変換"
binary=$(echo "iOS10" | xxd -b)
echo ${binary}
echo "iOS10をバイナリ変換してさらに戻す"
echo " 01101001 01001111 01010011 00110001 00110000 00001010 " | tr -d ' ' | sed 's/^/obase=16;ibase=2;/' | bc | xxd -p -r
